Revit 2027 API
DoubleArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DoubleArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As DoubleArrayIterator
public:
virtual DoubleArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> DoubleArrayIterator
override ReverseIterator : unit -> DoubleArrayIterator
Return Value
DoubleArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
DoubleArray Class
Autodesk.Revit.DB Namespace